# This is a Brewfile for Homebrew, which lists the packages and applications to be installed on the system.
# It includes both command-line tools and GUI applications, as well as VS Code extensions and global NPM packages.

# To create Brewfile run this command
# !⚠️! CAUTION !⚠️! This will overwrite the existing Brewfile with the currently installed packages on your system.
# brew bundle dump --file=./Brewfile

# Shell
brew "zsh"

# Git + Github
# brew "git"
# brew "gh"
brew "git-lfs"

# File Processing
brew "ffmpeg"
brew "gifsicle"
brew "exiftool"

# Development Tools
brew "go"
brew "jq"
brew "mkcert"
brew "pnpm"

# AI Tools
brew "gemini-cli"
cask "copilot-cli"

# Other
brew "googleworkspace-cli"

# GUI Applications
# cask "visual-studio-code"
cask "stats"
cask "bruno"

# VS Code Extensions
vscode "ai-engineer-coach.ai-engineer-coach"
# favourite themes for vscode
vscode "akamud.vscode-theme-onedark"
vscode "akamud.vscode-theme-onelight"
# vscode "bruno-api-client.bruno"
vscode "dbaeumer.vscode-eslint"
vscode "google.gemini-cli-vscode-ide-companion"
vscode "vitest.explorer"

# Global NPM Packages
npm "@google/jules"
# npm "corepack"
# npm "deno"

# Work Related
brew "colima"
brew "docker"
